Semester_5/RiAT/ShopProject/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.baeldung.com/springsoap/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getStudentRequest>
            <gs:name>John</gs:name>
        </gs:getStudentRequest>
    </soapenv:Body>
</soapenv:Envelope>